> [!info]+ Что такое функция
> ***Функция*** - вспомогательный алгоритм, который возвращает значение-результат (число, символ или объект другого типа)

==" def "== - фрагмент кода, который выполняет определённые операции и отдаёт результат
```py
def имя_функции (аргументы):
    тело_функции
    return результат
```
- `имя_функции` ― название, с помощью которого можно вызывать функцию в коде;
- `аргументы` ― значения, которые функция принимает на вход. Это поле может быть пустым;
- `тело_функции` ― набор инструкций, которые выполняются при вызове;
- `результат` ― значения, которые функция возвращает при завершении работы.

==" return "== - передача результата из выполненной функции

---
Рассмотрим на примере функцию, которая находит сумму двух чисел и возвращает результат вычислений:
```py
def sum(a, b):
	return a + b
```
Чтобы вызвать функцию, надо ввести её название и передать аргументы в скобках. 

> [!info]+ В общем виде синтаксис вызова выглядит так:
> ```
> имя_функции(аргументы)
> ```
> Теперь вызовем функцию для нахождения суммы, которую мы создали ранее. 
> Для этого введём название `sum` и в скобках передадим переменные `a` и `b`. Результат значения запишется в переменную `c`:
> ```py
> c = sum(a, b)
> ```

> [!question]+ Задача
> Написать программу, которая запрашивает результаты ЕГЭ по разным предметам, считает итог и сообщает, насколько хорошо ученик справился с экзаменами.
> > [!example]+ Код
> >```py
> ># Запрашиваем результаты ЕГЭ
> >math = int(input())
> >russian = int(input())
> >informatics = int(input())
> >
> ># Объявляем функцию, которая принимает результаты ЕГЭ, считает сумму и возвращает результат
> >def passed (math, russian, informatics):
> >	total = math + russian + informatics
> >	
> >	if 120 <= total < 210:
> >		print('Хорошо')
> >	elif 210 <= total < 240:
> >		print('Очень хорошо')
> >	elif total >= 240:
> >		print('Отлично')
> >	else:
> >		print('Неудовлетворительно')
> >	return total
> ># Вызываем функцию и выводим результат
> >print(passed(math, russian, informatics))
> >```
> > > [!abstract]+ Вывод:
> > >```py
> > > 40
> > > 80
> > > 80
> > > Хорошо
> > > 200
> > >```

---

> [!question]+ Задача
> Написать функцию, которая вычисляет сумму цифр числа

> [!example]+ Код
> ```py
> def sumDigits (n):
> 	sum = 0
> 	while n != 0:
> 		sum += n % 10
> 		n = n // 10
> 	return sum # !!
> ```
> ```py
> # основная программа
> sumDigits(12345)
> # сохранить в переменной
> n = sumDigits(12345)
> # сразу вывод на экран
> print( sumDigits(12345) )
> ```

---
## Использование функций
```py
x = 2 * sumDigits(n+5)
z = sumDigits(k) + sumDigits(m)
if sumDigits(n) % 2 == 0:
	print( "Сумма цифра чётная" )
	print( "Она равна", sumDigits(n))
```

> [!info]+ Функция, возвращающая целое число, может использоваться везде, где и целая величина!

> [!example]+ Одна функция вызывает другую:
> ```py
> def middle( a, b, c ):
> 	mi = min( a, b, c )
> 	ma = max( a, b, c )
> 	return a + b + c - mi - ma
> ```
> вызывается `min` и `max`

> [!tip]+ Как вернуть несколько значений?
> ```py
> def divmod( x, y ):
> 	d = x // y
> 	m = x % y
> 	return d, m
> ```
> ```py
> a, b = divmod( 7, 3 )
> print( a, b ) # 2 1
> ```
> ```py
> q = divmod ( 7, 3 )
> print( q ) 
> # (2, 1) кортеж - набор элементов
> # 2 - q[0] , 1 - q[1]
> ```

---
## Логические функции
> [!question]+ Задача
> Найти все простые числа в диапазоне от 2 до 1000

```py
for i in range(2, 1001):
	if isPrime(i):
		print( i )
```
`isPrime(i)`  - функция возвращающая [[2. Логический тип данных (True, False)|логическое значение]] (True/False)
> [!example]+ Код
> ```py
> def isPrime(n):
> 	k = 2
> 	while k * k <= n and n % k != 0:
> 		k += 1
> 	return (k*k > n)
> ```
>`return (k*k > n)` :
>```py
>if k*k > n:
>	return True
>else:
>	return False
>```