## Теория
==" from itertools import * "== - библиотека для решений задач по [[itertools (комбинаторика)|комбинаторике]]

---
### Задача 1
> [!question]+ Задача
> Маша составляет шестибуквенные слова перестановкой букв слова КАПКАН. При этом она избегает слов с двумя подряд одинаковыми буквами. Сколько различных кодов может составить Маша?

> [!failure]+ Код с ошибкой
> ```py
> from itertools import permutations
> counter = 0
> for i in permutations( 'капкан' ):
> 	w = ''.join(i)
> 	if w.count('аа') == 0 and w.count ('кк') == 0:
> 		counter+=1
> print(counter)

Код написан верно, но код будет одинаковые на вид слова считать ***два раза*** из-за перестановки повторяющихся букв
> [!example]+ Объяснение
> ```
> Слова "Капкан" и "капКан" одинаковые на вид, но отличаются лишь тем, что буквы "к" поменяли местами
> ```
>или же
>
>```
>Слова "кАпкан" и "капкАн" одинаковые на вид, но отличаются лишь тем, что буквы "а" поменяли местами
>```

Чтобы код не считал одно слово два и больше раз, нам нужно завести набор уникальных элементов.

==" set() "== - неупорядоченная коллекция уникальных элементов (множество)
> [!success]+ Исправный код
> ```py
> from itertools import permutations 
> words = set() 
> s = 'капкан' 
> for p in permutations(s):    
> 	w = ''.join(p)    
> 	if w.count('аа') == 0 and w.count('кк') == 0:
> 		words.add(w) #добавляем элемент во множество
> print(len(words))
> ```

Когда в множество добавляется элемент, который уже в нём есть, этот элемент игнорируется

---

> [!question]+ Problem 2
> Маша составляет 5-буквенные коды из букв **В, У, А, Л, Ь**. Каждую букву нужно использовать ровно 1 раз, при этом буква Ь не может стоять на первом месте и перед гласной. Сколько различных кодов может составить Маша?
> >[!code]+
> >```python
> > from itertools import permutations
> > 
> > n = 0
> > for x in permutations('ВУАЛЬ'):
> > 	s = ''.join(x)
> > 	if s[0] != 'Ь' and 'ЬУ' not in s and 'ЬА' not in s:
> > 		n += 1
> > print(n)
> >```

> [!question]+ Problem 3
> Все 4-буквенные слова, составленные из букв К, Л, Р, Т, записаны в алфавитном порядке и пронумерованы. 
> Вот начало списка: 
> 1. ККК**К** 
> 2. ККК**Л** 
> 3. ККК**Р** 
> 4. ККК**Т** 
> …… 
>
> Запишите слово, которое стоит на 67-м месте от начала списка.
> >[!code]+
> > ```python
> > from itertools import product
> > 
> > c = list(product('КЛРТ', repeat = 4)) # Пишем в порядке последних букв в словах (сверху вниз)
> > print(c[67 - 1])
> >```

> [!question]+ Problem 4
> Все 5-буквенные слова, составленные из 5 букв А, К, Л, О, Ш, записаны в алфавитном порядке. 
> Вот начало списка:
> 1. АААА**А**
> 2. АААА**К** 
> 3. АААА**Л** 
> 4. АААА**О** 
> 5. АААА**Ш** 
> 6. АААКА 
> ……
> 
> На каком месте от начала списка стоит слово ШКОЛА?
> >[!code]+
> >```python
> > from itertools import product
> > c = 0
> > cmb = product('АКЛОШ', repeat = 5)
> > for i in cmb:
> > 	c = c + 1
> > 	s = ''.join(i)
> > 	if s == 'ШКОЛА':
> > 		print(c)
> > 		break
> >```

> [!question]+ Problem 5
> Определите количество **семизначных чисел**, записанных в **девятеричной системе счисления**, в записи которых ровно одна цифра 6 и ровно две нечётные цифры.
> >[!code]+
> > ```python
> > from itertools import product
> >  
> > count = 0 
> > for p in product("012345678", repeat=7): 
> > 	if p.count("6") == 1: 
> > 		if p[0]!="0" and(p.count("1")+p.count("3") + p.count("5") +p.count("7"))==2: 
> > 			count+=1 
> > print(count)
> > ```

> [!question]+ Problem 6
> Сколько существует различных **трёхзначных чисел**, записанных в **шестеричной системе счисления**, в записи которых цифры следуют слева направо в невозрастающем порядке?
> >[!code]+
> >```py
> > from itertools import product 
> > 
> > alphabet = '012345' 
> > ap=[] 
> > for i in product(alphabet, repeat=3): 
> > 	if i[0] != '0' and int(i[0]) >= int(i[1]) >= int(i[2]): 
> > 		ap.append(i) 
> > print(len(ap))
> >```

---

> [!question]+ Problem
> Миша забыл пароль для входа в свои социальные сети. Но он помнит, что он был из 4 символов и начинался на гласную из списка АОУИ и заканчивался на какую-то из них. А в середине стоят цифры. Сколько вариантов для перебора пароля у Миши?
> > [!success]- Answer
> > ```py
> > 1600
> > ```
> 
> >[!code]- Solution
> >```python
> > from itertools import product  
> >   
> > c = 0  
> > for i in product('АОУИ0123456789', repeat=4):  
> >   s = ''.join(i)  
> >   if s[0] in 'АОУИ' \  
> >           and s[3] in 'АОУИ' \  
> >           and s[1] in '0123456789' \  
> >           and s[2] in '0123456789':  
> >     c += 1  
> > print(c)
> >``` 

> [!question]+ Problem
> Определите количество 12-ричных пятизначных чисел, в записи которых ровно одна цифра 7 и не более трёх цифр с числовым значением, превышающим 8.
> > [!success]- Answer
> > ```py
> > 67476
> > ```
> 
> >[!code]- Solution
> >```py
> > from itertools import product  
> >   
> > count = 0  
> > for i in product('0123456789AB', repeat = 5):  
> >   s = ''.join(i)  
> >   if s[0] != "0":  
> >     if s.count('7') == 1 and (s.count('9') + s.count('A') + s.count('B')) <= 3:  
> >       count += 1  
> > print(count)
> >``` 

> [!question]+ Problem
> Все шестибуквенные слова, в составе которых могут быть только русские буквы **В, О, С, Т, Р, Г** записаны в алфавитном порядке и пронумерованы, начиная с 1.
> 
> Ниже приведено начало списка.
> 
> 1. ВВВВВ**В**
> 2. ВВВВВ**Г**
> 3. ВВВВВ**О**
> 4. ВВВВВ**Р**
> 5. ВВВВВ**С**
> 6. ВВВВВ**Т**
> 7. ВВВВГВ  
>     …
> 
> Под каким номером стоит первое слово, расположенное после слова **СГОВОР**, в котором **никакие две согласные буквы не стоят рядом**?
> > [!success]- Answer
> > ```py
> > 33771
> > ```
> 
> >[!code]- Solution
> > ```python
> > from itertools import product  
> >   
> > sogl = 'ВГРСТ'  
> > words = [''.join(p) for p in product('ВГОРСТ', repeat=6)]  
> > start_index = words.index('СГОВОР')  
> > for i in range(start_index, len(words)):  
> >     if (words[i][0] in sogl  
> >         and words[i][1] == 'О'  
> >         and words[i][2] in sogl  
> >         and words[i][3] == 'О'  
> >         and words[i][4] in sogl  
> >         and words[i][5] == 'О') \  
> >             or \  
> >             (words[i][0] == 'О'  
> >              and words[i][1] in sogl  
> >              and words[i][2] == 'О'  
> >              and words[i][3] in sogl  
> >              and words[i][4] == 'О'  
> >              and words[i][5] in sogl):  
> >         print(i + 1, words[i])  # Плюс один, иначе будет выведен индекс слова, а не его порядковый номер  
> >         break
> > ```