==" A.replase( заменить" ", на " ", столько раз " " ) "== - функция, которая заменяет элементы в строке
==" A.count( " элемент ") "== - функция, которая в строке подсчитывает кол-во указанных элементов
> [!question]+ Задача
> Исполнитель Редактор получает на вход строку цифр и преобразовывает её. 
Редактор может выполнять две команды, в обеих командах v и w обозначают цепочки цифр.
>
***А) заменить (v, w).***
Эта команда заменяет в строке первое слева вхождение цепочки v на цепочку w. Например, выполнение команды 
заменить (111, 27) преобразует строку 05111150 в строку 0527150. Если в строке нет вхождений цепочки v, то выполнение команды заменить (v, w) не меняет эту строку.
>
***Б) нашлось (v).***
Эта команда проверяет, встречается ли цепочка v в строке исполнителя Редактор. Если она встречается, то команда возвращает логическое значение «истина», в противном случае возвращает значение «ложь». Строка исполнителя при этом не изменяется. 

### Задача (Когда известно, какие цифры в числе):
*Условие то же*
***Дана программа для Редактора:***
```
НАЧАЛО 
	ПОКА нашлось (1111) ИЛИ нашлось (8888) 
		ЕСЛИ нашлось (1111) 
			ТО заменить (1111, 8) 
			ИНАЧЕ заменить (8888, 11) 
		КОНЕЦ ЕСЛИ 
	КОНЕЦ ПОКА 
КОНЕЦ
```

Какая строка получится в результате применения приведённой ниже программы к строке, ***состоящей из 82 идущих подряд цифр 8***? В ответе запишите полученную строку.

---
#### Решение:
Для начала нужно переписать код из задачи на алгоритмическом языке в код на python:

> [!example]+ Код
> ```python
>a = '8' * 82
># 82 восьмёрки под ряд
>
>while '1111' in a or '8888' in a:
># Пока в "a" есть "1111" или в "a" есть "8888
>
>	if '1111' in a:
>	# Если в "а" есть "1111", то:  
>		a = a.replace('1111', '8', 1)
>		# В "а" (заменить "1111", на "8", 1 раз) 
>		
>	else:
>	# иначе:  
>		a = a.replace('8888', '11', 1)
>		# В "а" (заменить "8888", на "11", 1 раз)  
>		
>print(a)
># Вывести "а"
> ```
> > [!abstract]+ Вывод:
> > ```py
> > 118
> > ```

---

### Задача (Когда неизвестно, какие цифры в числе):
*Условие то же*
***Дана программа для Редактора:***
```
НАЧАЛО 
	ПОКА нашлось (57) ИЛИ нашлось (877) ИЛИ нашлось (777) 
		ЕСЛИ нашлось (57) 
			ТО заменить (57, 7) 
		КОНЕЦ ЕСЛИ 
		ЕСЛИ нашлось (877) 
			ТО заменить (877, 75) 
		КОНЕЦ ЕСЛИ 
		ЕСЛИ нашлось (777) 
			ТО заменить (777, 8) 
		КОНЕЦ ЕСЛИ 
	КОНЕЦ ПОКА 
КОНЕЦ
```
На вход приведённой выше программе поступает строка, ***начинающаяся с цифры «8», а затем содержащая n цифр «7» (3 < n < 10 000).***

Определите наибольшее возможное значение произведения числовых значений цифр в строке, которая может быть результатом выполнения программы.

---
#### Решение:
```py
mx = 0  
for n in range(4, 10000):  
    s = '8' + '7' * n  
    while '57' in s or '877' in s or '777' in s:  
        if '57' in s:  
            s = s.replace('57', '7', 1)  
        if '877' in s:  
            s = s.replace('877', '75', 1)  
        if '777' in s:  
            s = s.replace('777', '8', 1)  
    sm = 1  
    for i in s:  
        sm *= int(i)  
        mx = max(mx, sm)  
print(mx)
```

> [!abstract]+ Вывод:
> ```py
>19208000
> ```
### Задача 3
**Условие то же*
Дана программа для Редактора:
```
НАЧАЛО 
ПОКА нашлось (11) 
	ЕСЛИ нашлось (112) 
		ТО заменить (112, 6) 
		ИНАЧЕ заменить (11, 3) 
КОНЕЦ ПОКА 
КОНЕЦ
```
Исходная строка содержит десять единиц и три двойки, других цифр нет, точный порядок расположения единиц и двоек неизвестен. Какую наибольшую сумму цифр может иметь строка, которая получится после выполнения программы?

---
#### Решение:
- Сумма цифр будет наибольшей, если сначала будут идти 112. Так как их замена даёт наибольшее число.
```py
s='112'*3 + '1'*4 
while '11' in s : 
	if '112' in s: 
		s = s.replace('112','6',1) 
	else: 
		s = s.replace('11','3',1)
print(s.count('6') * 6 + s.count('3') * 3)
```

> [!abstract]+ Вывод
>```py
>24

### Задача 4
**Условие то же*
Дана программа для Редактора:
```
НАЧАЛО 
ПОКА нашлось (111) 
	заменить (111, 2) 
	заменить (222, 11) 
КОНЕЦ ПОКА 
КОНЕЦ
```
К исходной строке, содержащей более 60 единиц и не содержащей других символов, применили приведённую выше программу. В результате получилась строка 2211. Какое наименьшее количество единиц могло быть в исходной строке?

---
#### Решение:
```py
for n in range(61,100000000000000):  
    s = '1' * n  
    while '111' in s:  
        s=s.replace('111','2',1)  
        s=s.replace('222','11',1)  
    if s == '2211':  
        break  
print(n)
```
> [!abstract]+ Вывод
> ```py
> 64